tap "homebrew/cask-fonts"

# CLI Tools
brew "git"
brew "wget"
brew "node"
brew "tree"
brew "yazi"
brew "ffmpegthumbnailer"
brew "ffmpeg"
brew "p7zip"
brew "jq"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "bat"
brew "zoxide"
brew "imagemagick"
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-meslo-lg-nerd-font"

# Applications (GUI)
cask "kitty"
cask "anki"
cask "arc"
cask "obsidian"
cask "nordpass"
cask "nordvpn"
cask "spotify"
cask "discord"
cask "raycast"
cask "qmk-toolbox"
cask "mos"

